# DataFrame and Series

In [1]:
import pandas as pd
#import openpyxl as opx

In [55]:
#data frame definieren beispiel buch

data = [["Mark", 55, "Italy", 4.5, "Europe"],
        ["John", 33, "USA", 6.7, "America"],
        ["Tim", 41, "USA", 3.9, "America"],
        ["Jenny", 12, "Germany", 9.0, "Europe"]]
df2 = pd.DataFrame(data=data,
                  columns=["name", "age", "country",
                           "score", "continent"],
                  index=[1001, 1000, 1002, 1003])
df2

       name  age  country  score continent
1001   Mark   55    Italy    4.5    Europe
1000   John   33      USA    6.7   America
1002    Tim   41      USA    3.9   America
1003  Jenny   12  Germany    9.0    Europe

In [42]:
# dataframe definieren - eigenes beispiel

df3 = pd.DataFrame([["Peugeot", "605", 1995],
                   ["Fiat", "Panda", 2003],
                   ["Citroen", "Picasso", 2008]],
                  ["001", "003", "002"],
                  ["Hersteller", "Modell", "Baujahr"])
df3

    Hersteller   Modell  Baujahr
001    Peugeot      605     1995
003       Fiat    Panda     2003
002    Citroen  Picasso     2008

In [168]:
#  dataframe aus Excel lesen
df = pd.read_excel("xl/course_participants.xlsx")
df

   user_id    name  age  country continent  score
0     1001    Mark   55    Italy    Europe    4.5
1     1000    John   33      USA   America    6.7
2     1002     Tim   41      USA   America    3.9
3     1003   Jenny   12  Germany    Europe    9.0
4     1004  Markus   39  Austria    Europe    8.0
5     1008   Simon   25    Italy    Europe    9.0

In [131]:
# df von excelsheet ausgeben
df.set_index("user_id")

           name  age  country continent  score
user_id
1001       Mark   55    Italy    Europe    4.5
1000       John   33      USA   America    6.7
1002        Tim   41      USA   America    3.9
1003      Jenny   12  Germany    Europe    9.0
1004     Markus   39  Austria    Europe    8.0
1008      Simon   25    Italy    Europe    9.0

In [133]:
#df.index = range(100, len(df)+100, 10)
df2 = df.set_index("user_id")
df2

           name  age  country continent  score
user_id
1001       Mark   55    Italy    Europe    4.5
1000       John   33      USA   America    6.7
1002        Tim   41      USA   America    3.9
1003      Jenny   12  Germany    Europe    9.0
1004     Markus   39  Austria    Europe    8.0
1008      Simon   25    Italy    Europe    9.0

In [141]:
df2.reindex(range(1000,1011)).sort_index(ascending=True)

           name   age  country continent  score
user_id
1000       John  33.0      USA   America    6.7
1001       Mark  55.0    Italy    Europe    4.5
1002        Tim  41.0      USA   America    3.9
1003      Jenny  12.0  Germany    Europe    9.0
1004     Markus  39.0  Austria    Europe    8.0
1005        NaN   NaN      NaN       NaN    NaN
1006        NaN   NaN      NaN       NaN    NaN
1007        NaN   NaN      NaN       NaN    NaN
1008      Simon  25.0    Italy    Europe    9.0
1009        NaN   NaN      NaN       NaN    NaN
1010        NaN   NaN      NaN       NaN    NaN

In [145]:
df2.sort_index().sort_index(key = lambda x: x%2 == 1)

           name  age  country continent  score
user_id
1000       John   33      USA   America    6.7
1002        Tim   41      USA   America    3.9
1004     Markus   39  Austria    Europe    8.0
1008      Simon   25    Italy    Europe    9.0
1001       Mark   55    Italy    Europe    4.5
1003      Jenny   12  Germany    Europe    9.0

In [71]:
#sortieren
df.sort_index(axis="rows", ascending=False)

      user_id    name  age  country continent  score
uiae
5          89   Simon   25    Italy    Europe    9.0
4        1004  Markus   39  Austria    Europe    8.0
3        1003   Jenny   12  Germany    Europe    9.0
2        1002     Tim   41      USA   America    3.9
1        1000    John   33      USA   America    6.7
0        1001    Mark   55    Italy    Europe    4.5

In [18]:
df.sort_index(axis="columns", ascending=True)

   age continent  country    name  score  user_id
0   55    Europe    Italy    Mark    4.5     1001
1   33   America      USA    John    6.7     1000
2   41   America      USA     Tim    3.9     1002
3   12    Europe  Germany   Jenny    9.0     1003
4   39    Europe  Austria  Markus    8.0     1004
5   25    Europe    Italy   Simon    9.0       89

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 1001 to 1003
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       4 non-null      object
 1   age        4 non-null      int64
 2   country    4 non-null      object
 3   score      4 non-null      float64
 4   continent  4 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 192.0+ bytes

## Index

In [169]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [174]:
df.index = df["user_id"]

In [325]:
#df.index.name = "user_id"
df

properties    name  age  country continent  score
user_id
1001          Mark   55    Italy    Europe    4.5
1000          John   33      USA   America    6.7
1002           Tim   41      USA   America    3.9
1003         Jenny   12  Germany    Europe    9.0
1004        Markus   39  Austria    Europe    8.0
1008         Simon   25    Italy    Europe    9.0

In [189]:
# "reset_index" turns the index into a column, replacing the
# index with the default index. This corresponds to the DataFrame
# from the beginning that we loaded from Excel.
df.reset_index()

   user_id    name  age  country continent  score
0     1001    Mark   55    Italy    Europe    4.5
1     1000    John   33      USA   America    6.7
2     1002     Tim   41      USA   America    3.9
3     1003   Jenny   12  Germany    Europe    9.0
4     1004  Markus   39  Austria    Europe    8.0
5     1008   Simon   25    Italy    Europe    9.0

In [205]:
# "reset_index" turns "user_id" into a regular column and
# "set_index" turns the column "name" into the index
df.reset_index().set_index("name")

        user_id  age  country continent  score
name
Mark       1001   55    Italy    Europe    4.5
John       1000   33      USA   America    6.7
Tim        1002   41      USA   America    3.9
Jenny      1003   12  Germany    Europe    9.0
Markus     1004   39  Austria    Europe    8.0
Simon      1008   25    Italy    Europe    9.0

In [21]:
df.reindex([999, 1000, 1001, 1004])

         name   age country  score continent
user_id
999       NaN   NaN     NaN    NaN       NaN
1000     John  33.0     USA    6.7   America
1001     Mark  55.0   Italy    4.5    Europe
1004      NaN   NaN     NaN    NaN       NaN

In [82]:
df.sort_index(ascending=False)
df.sort_values("score", ascending = False)#.filter(items=["name", "country"])

          name  age  country  score continent
user_id
1003     Jenny   12  Germany    9.0    Europe
1000      John   33      USA    6.7   America
1001      Mark   55    Italy    4.5    Europe
1002       Tim   41      USA    3.9   America

In [83]:
df.sort_values(["continent", "age"])

          name  age  country  score continent
user_id
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe
1001      Mark   55    Italy    4.5    Europe

## Columns

In [207]:
df.columns

Index(['name', 'age', 'country', 'continent', 'score'], dtype='object')

In [211]:
df.columns.name = "properties"
df

properties    name  age  country continent  score
user_id
1001          Mark   55    Italy    Europe    4.5
1000          John   33      USA   America    6.7
1002           Tim   41      USA   America    3.9
1003         Jenny   12  Germany    Europe    9.0
1004        Markus   39  Austria    Europe    8.0
1008         Simon   25    Italy    Europe    9.0

In [213]:
df.rename(columns={"name": "First Name", "age": "Age", "continent" : "Continet", "score" : "Test Score"})

properties First Name  Age  country Continet  Test Score
user_id
1001             Mark   55    Italy   Europe         4.5
1000             John   33      USA  America         6.7
1002              Tim   41      USA  America         3.9
1003            Jenny   12  Germany   Europe         9.0
1004           Markus   39  Austria   Europe         8.0
1008            Simon   25    Italy   Europe         9.0

In [229]:
#df.drop(columns=["name", "country"],     index=[1000, 1003])
df.drop(columns=["continent", "age"])
#df.values

properties    name  country  score
user_id
1001          Mark    Italy    4.5
1000          John      USA    6.7
1002           Tim      USA    3.9
1003         Jenny  Germany    9.0
1004        Markus  Austria    8.0
1008         Simon    Italy    9.0

In [231]:
df.T  # Shortcut for df.transpose()

user_id       1001     1000     1002     1003     1004    1008
properties
name          Mark     John      Tim    Jenny   Markus   Simon
age             55       33       41       12       39      25
country      Italy      USA      USA  Germany  Austria   Italy
continent   Europe  America  America   Europe   Europe  Europe
score          4.5      6.7      3.9      9.0      8.0     9.0

In [246]:
df.loc[[1000,1002], ["age", "country","score"]]

properties  age country  score
user_id
1000         33     USA    6.7
1002         41     USA    3.9

In [303]:
#scalar
df.loc[1003,"country"]

'Germany'

In [ ]:
#series
df.loc[:1003,"country"]

user_id
1001      Italy
1000        USA
1002        USA
1003    Germany
Name: country, dtype: object

In [306]:
#series
df.loc[1003,:]

properties
name           Jenny
age               12
country      Germany
continent     Europe
score            9.0
Name: 1003, dtype: object

In [284]:
df.loc[df.sort_index().index[:-2], ["country", "score", "age"]]

properties  country  score  age
user_id
1000            USA    6.7   33
1001          Italy    4.5   55
1002            USA    3.9   41
1003        Germany    9.0   12

In [316]:
df[["country","age", "score"]]

properties  country  age  score
user_id
1001          Italy   55    4.5
1000            USA   33    6.7
1002            USA   41    3.9
1003        Germany   12    9.0
1004        Austria   39    8.0
1008          Italy   25    9.0

In [291]:
df.reindex(axis=1, )

properties    name  age  country continent  score
user_id
1001          Mark   55    Italy    Europe    4.5
1000          John   33      USA   America    6.7
1002           Tim   41      USA   America    3.9
1003         Jenny   12  Germany    Europe    9.0
1004        Markus   39  Austria    Europe    8.0
1008         Simon   25    Italy    Europe    9.0

In [247]:
df.loc[:, ["continent", "country", "name", "age", "score"]]

properties continent  country    name  age  score
user_id
1001          Europe    Italy    Mark   55    4.5
1000         America      USA    John   33    6.7
1002         America      USA     Tim   41    3.9
1003          Europe  Germany   Jenny   12    9.0
1004          Europe  Austria  Markus   39    8.0
1008          Europe    Italy   Simon   25    9.0

# Data Manipulation
## Selecting Data

In [66]:
# Using scalars for both row and column selection returns a scalar
df.loc[1003, ["country", "name"]]

country    Germany
name         Jenny
Name: 1003, dtype: object

In [67]:
# Using a scalar on either the row or column selection returns a Series
df.loc[[1001, 1002], "age"]

user_id
1001    55
1002    41
Name: age, dtype: int64

In [317]:
# Selecting multiple rows and columns returns a DataFrame
df.loc[1001:, ["name", "country"]]

properties    name  country
user_id
1001          Mark    Italy
1000          John      USA
1002           Tim      USA
1003         Jenny  Germany
1004        Markus  Austria
1008         Simon    Italy

In [77]:
df

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.5    Europe
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

In [318]:
df.iloc[0, 0]  # Returns a Scalar

'Mark'

In [319]:
df.loc[1001, "name"]

'Mark'

In [321]:
df.iloc[[0, 2], 1]  # Returns a Series

user_id
1001    55
1002    41
Name: age, dtype: int64

In [322]:
df.iloc[:3, [0, 2]]  # Returns a DataFrame

properties  name country
user_id
1001        Mark   Italy
1000        John     USA
1002         Tim     USA

In [336]:
#tf = (df["name"] !="Mark")
tf = df["name"].apply(lambda x: len(x)<5)
tf  # This is a Series with only True/False

user_id
1001     True
1000     True
1002     True
1003    False
1004    False
1008    False
Name: name, dtype: bool

In [341]:
###  Eigenes Beispiel
df3

    Hersteller   Modell  Baujahr
001    Peugeot      605     1995
003       Fiat    Panda     2003
002    Citroen  Picasso     2008

In [335]:
df.loc[tf, :]

properties   name  age  country continent  score
user_id
1001         Mark   55    Italy    Europe    4.5
1000         John   33      USA   America    6.7
1002          Tim   41      USA   America    3.9
1003        Jenny   12  Germany    Europe    9.0
1008        Simon   25    Italy    Europe    9.0

In [ ]:
df.loc[df.index > 1001, :]

In [ ]:
df.loc[df["country"].isin(["Italy", "Germany"]), :]

In [ ]:
# This could be the yearly rainfall in millimeters
rainfall = pd.DataFrame(data={"City 1": [300.1, 100.2],
                              "City 2": [400.3, 300.4],
                              "City 3": [1000.5, 1100.6]})
rainfall

In [ ]:
rainfall < 400

In [ ]:
rainfall[rainfall < 400]

In [ ]:
# A MultiIndex needs to be sorted
df_multi = df.reset_index().set_index(["continent", "country"])
df_multi = df_multi.sort_index()
df_multi

In [ ]:
df_multi.loc["Europe", :]

In [ ]:
df_multi.loc[("Europe", "Italy"), :]

In [ ]:
df_multi.reset_index(level=0)

## Setting Data

In [ ]:
# Copy the DataFrame first to leave the original untouched
df2 = df.copy()

In [ ]:
df2.loc[1000, "name"] = "JOHN"
df2

In [ ]:
df2.loc[[1000, 1001], "score"] = [3, 4]
df2

In [ ]:
tf = (df2["age"] < 20) | (df2["country"] == "USA")
df2.loc[tf, "name"] = "xxx"
df2

In [ ]:
# Copy the DataFrame first to leave the original untouched
rainfall2 = rainfall.copy()
rainfall2

In [ ]:
# Set the values to 0 wherever they are below 400
rainfall2[rainfall2 < 400] = 0
rainfall2

In [ ]:
df2.replace("USA", "U.S.")

In [ ]:
df2.loc[:, "discount"] = 0
df2.loc[:, "price"] = [49.9, 49.9, 99.9, 99.9]
df2

In [ ]:
df2 = df.copy()  # Let's start with a fresh copy
df2.loc[:, "birth year"] = 2021 - df2["age"]
df2

## Missing Data

In [ ]:
df2 = df.copy() # Let's start with a fresh copy
df2.loc[1000, "score"] = None
df2.loc[1003, :] = None
df2

In [ ]:
df2.dropna()

In [ ]:
df2.dropna(how="all")

In [ ]:
df2.isna()

In [ ]:
df2.fillna({"score": df2["score"].mean()})

## Duplicate Data

In [ ]:
df.drop_duplicates(["country", "continent"])

In [ ]:
df["country"].is_unique

In [ ]:
df["country"].unique()

In [ ]:
# By default, it marks only duplicates as True, i.e.
# without the first occurrence
df["country"].duplicated()

In [ ]:
# To get all rows where "country" is duplicated, use
# keep=False
df.loc[df["country"].duplicated(keep=False), :]

## Arithmetic Operations

In [ ]:
rainfall

In [ ]:
rainfall + 100

In [ ]:
more_rainfall = pd.DataFrame(data=[[100, 200], [300, 400]],
                             index=[1, 2],
                             columns=["City 1", "City 4"])
more_rainfall

In [ ]:
rainfall + more_rainfall

In [ ]:
rainfall.add(more_rainfall, fill_value=0)

In [ ]:
# A Series taken from a row
rainfall.loc[1, :]

In [ ]:
rainfall + rainfall.loc[1, :]

In [ ]:
# A Series taken from a column
rainfall.loc[:, "City 2"]

In [ ]:
rainfall.add(rainfall.loc[:, "City 2"], axis=0)

In [ ]:
# Let's create a new DataFrame
users = pd.DataFrame(data=[" mArk ", "JOHN  ", "Tim", " jenny"],
                     columns=["name"])
users

In [ ]:
users_cleaned = users.loc[:, "name"].str.strip().str.capitalize()
users_cleaned

In [ ]:
users_cleaned.str.startswith("J")

## Applying a Function

In [ ]:
rainfall

In [ ]:
def format_string(x):
    return f"{x:,.2f}"

In [ ]:
# Note that we pass in the function without calling it,
# i.e., format_string and not format_string()!
rainfall.applymap(format_string)

In [ ]:
rainfall.applymap(lambda x: f"{x:,.2f}")

# Combining DataFrames
## Concatenating

In [ ]:
data = [[15, "France", 4.1, "Becky"],
        [44, "Canada", 6.1, "Leanne"]]
more_users = pd.DataFrame(data=data,
                          columns=["age", "country", "score", "name"],
                          index=[1000, 1011])
more_users

In [ ]:
pd.concat([df, more_users], axis=0)

In [ ]:
data = [[3, 4],
        [5, 6]]
more_categories = pd.DataFrame(data=data,
                               columns=["quizzes", "logins"],
                               index=[1000, 2000])
more_categories

In [ ]:
pd.concat([df, more_categories], axis=1)

## Joining and Merging

In [ ]:
df1 = pd.DataFrame(data=[[1, 2], [3, 4], [5, 6]],
                   columns=["A", "B"])
df1

In [ ]:
df2 = pd.DataFrame(data=[[10, 20], [30, 40]],
                   columns=["C", "D"], index=[1, 3])
df2

In [ ]:
df1.join(df2, how="inner")

In [ ]:
df1.join(df2, how="left")

In [ ]:
df1.join(df2, how="right")

In [ ]:
df1.join(df2, how="outer")

In [ ]:
# Add a column called "category" to both DataFrames
df1["category"] = ["a", "b", "c"]
df2["category"] = ["c", "b"]

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1.merge(df2, how="inner", on=["category"])

In [ ]:
df1.merge(df2, how="left", on=["category"])

# Data Aggregation and Descriptive Statistics
## Descriptive Statistics

In [ ]:
rainfall

In [ ]:
rainfall.mean()

In [ ]:
rainfall.mean(axis=1)

## Grouping

In [ ]:
df.groupby(["continent"]).mean()

In [ ]:
df.groupby(["continent", "country"]).mean()

In [ ]:
selection = df.loc[:, ["age", "score", "continent"]]
selection.groupby(["continent"]).agg(lambda x: x.max() - x.min())

## Pivoting and Melting

In [ ]:
data = [["Oranges", "North", 12.30],
        ["Apples", "South", 10.55],
        ["Oranges", "South", 22.00],
        ["Bananas", "South", 5.90],
        ["Bananas", "North", 31.30],
        ["Oranges", "North", 13.10]]

sales = pd.DataFrame(data=data,
                     columns=["Fruit", "Region", "Revenue"])
sales

In [ ]:
pivot = pd.pivot_table(sales,
                       index="Fruit", columns="Region",
                       values="Revenue", aggfunc="sum",
                       margins=True, margins_name="Total")
pivot

In [ ]:
pd.melt(pivot.iloc[:-1,:-1].reset_index(),
        id_vars="Fruit",
        value_vars=["North", "South"], value_name="Revenue")

# Plotting
## Matplotlib

In [ ]:
import numpy as np
%matplotlib inline
# Or %matplotlib notebook

In [ ]:
data = pd.DataFrame(data=np.random.rand(4, 4) * 100000,
                    index=["Q1", "Q2", "Q3", "Q4"],
                    columns=["East", "West", "North", "South"])
data.index.name = "Quarters"
data.columns.name = "Region"
data

In [ ]:
data.plot()  # Shortcut for data.plot.line()

## Plotly

In [ ]:
# Set the plotting backend to Plotly
pd.options.plotting.backend = "plotly"

In [ ]:
data.plot()

In [ ]:
# Display the same data as bar plot
data.plot.bar(barmode="group")

# Data Import and Export
## Exporting to a CSV file

In [ ]:
df.to_csv("course_participants.csv")

## Importing a CSV file

In [ ]:
msft = pd.read_csv("csv/MSFT.csv")

In [ ]:
msft.info()

In [ ]:
# I am selecting a few columns because of space issues
# You can also just run: msft.head()
msft.loc[:, ["Date", "Adj Close", "Volume"]].head()

In [ ]:
msft.loc[:, ["Date", "Adj Close", "Volume"]].tail(2)

In [ ]:
msft.loc[:, ["Adj Close", "Volume"]].describe()

In [ ]:
# The line break in the URL is only to make it fit on the page
url = ("https://raw.githubusercontent.com/fzumstein/"
       "python-for-excel/1st-edition/csv/MSFT.csv")
msft = pd.read_csv(url)

In [ ]:
msft.loc[:, ["Date", "Adj Close", "Volume"]].head(2)